thread-safe-tramp-2018-09.org
# -*- mode: Org; fill-column: 60; -*-
#+TITLE:    Emacs Berlin Meetup: Using Threads in Emacs Lisp - the Tramp Case
#+AUTHOR:   Michael Albinus
#+EMAIL:    michael.albinus@gmx.de
#+DATE:     <2018-09-26>
#+STARTUP:  overview hideblocks hidestars
#+PROPERTY: header-args :results verbatim :noweb yes

* Emacs Lisp and Threads

** Treads have been added in Emacs 26.1. No major package
   has used it there, 'tho.


** During the current development of Emacs 27, Tramp has
   started as first major package to apply threads. While
   implementing this, thread support in Emacs has been
   extended as needs arise. The following examples are based
   on the Emacs git branch ~feature/tramp-thread-safe~; some
   examples will work only there.


** Other packages (Gnus, for example) plan also to use threads.


* Basic Thread Functions in Emacs Lisp

** A thread is the concurrent invocation of a Lisp function.
   It runs until the execution of the function is finished,
   or it is interrupted by a signal.  This is *mostly
   cooperative*, meaning that Emacs will only switch
   execution between threads at well-defined times.

   #+NAME: Make_thread
   #+BEGIN_SRC elisp
   (defun my-thread ()
     (sleep-for 10))

   (make-thread #'my-thread "my thread")
   #+END_SRC

   There is no real concurrency that two threads run in
   parallel on different CPUs.  There is always only one
   active thread at any given time.  Emacs threads are not
   intended for number crunching.


** If Emacs is compiled with thread support, there are some
   helper functions:

   #+NAME: Thread_helper
   #+BEGIN_SRC elisp
   main-thread
   (current-thread)
   (all-threads)
   #+END_SRC


** Thread switching will occur upon explicit request via
   ~thread-yield~, when waiting for keyboard input or for
   process output (e.g., during ~accept-process-output~), or
   during blocking operations relating to threads, such as
   mutex locking or ~thread-join~.

   #+NAME: Thread_yield
   #+BEGIN_SRC elisp
   (defvar wait t)
   (defun my-thread ()
     (while wait (thread-yield))
     (setq wait t))

   (setq wait t)
   (make-thread #'my-thread "my thread 1")
   (make-thread #'my-thread "my thread 2")

   ;; (setq wait nil)
   #+END_SRC


** The result of a thread evaluation is captured by
   ~thread-join~.  It blocks the current thread until the requested
   thread exits, or the current thread is signaled.  This result could
   be even retrieved by a ~thread-join~ call after that thread has
   finished, as many time as requested.

   #+NAME: Thread_join
   #+BEGIN_SRC elisp
   (defun my-thread1 ()
     (sleep-for 10)
     ;; The result.
     42)

   (defun my-thread2 ()
     (message "Thread %s has returned %s" thread1 (thread-join thread1)))

   (setq thread1 (make-thread #'my-thread1 "my thread 1"))
   (setq thread2 (make-thread #'my-thread2 "my thread 2"))

   ;; (thread-join thread1)
   #+END_SRC


** A thread could be signaled from another thread by ~thread-signal~.

   #+NAME: Thread_signal
   #+BEGIN_SRC elisp
   (defun my-thread1 ()
     (sleep-for 10)
     (thread-signal thread2 'error '(data)))

   (defun my-thread2 ()
     (condition-case err
         (while t (sleep-for 0.1))
       (error (message "Thread %s signaled by `%s'" (current-thread) err))))

   (setq thread1 (make-thread #'my-thread1 "my thread 1"))
   (setq thread2 (make-thread #'my-thread2 "my thread 2"))
   #+END_SRC

   Restriction: signaling the main thread does not work this
   way.  The main thread just prints the error message.

   #+NAME: Main_thread_signal
   #+BEGIN_SRC elisp
   (defun my-thread ()
     (thread-signal main-thread 'error '(data)))

   (setq thread (make-thread #'my-thread "my thread"))
   #+END_SRC


