thread-safe-tramp-2018-09.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-09-27 Thu 21:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs Berlin Meetup: Using Threads in Emacs Lisp - the Tramp Case</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Michael Albinus" />
</head>
<body>
<div id="content">
<h1 class="title">Emacs Berlin Meetup: Using Threads in Emacs Lisp - the Tramp Case</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgdeeb637">1. Emacs Lisp and Threads</a>
<ul>
<li><a href="#orge8e926d">1.1. Treads have been added in Emacs 26.1. No major package</a></li>
<li><a href="#org726417d">1.2. During the current development of Emacs 27, Tramp has</a></li>
<li><a href="#org01ec4b2">1.3. Other packages (Gnus, for example) plan also to use threads.</a></li>
</ul>
</li>
<li><a href="#orgcec892d">2. Basic Thread Functions in Emacs Lisp</a>
<ul>
<li><a href="#org829ce5a">2.1. A thread is the concurrent invocation of a Lisp function.</a></li>
<li><a href="#org2d0df8d">2.2. If Emacs is compiled with thread support, there are some</a></li>
<li><a href="#orgcda4933">2.3. Thread switching will occur upon explicit request via</a></li>
<li><a href="#orgfbd7bec">2.4. The result of a thread evaluation is captured by</a></li>
<li><a href="#org421ac96">2.5. A thread could be signaled from another thread by <code>thread-signal</code>.</a></li>
<li><a href="#orgd15fded">2.6. There are further convenience variables and functions like</a></li>
</ul>
</li>
<li><a href="#org473ce04">3. Thread Synchronization</a>
<ul>
<li><a href="#org3a4873e">3.1. A mutex is an exclusive lock.  At any moment, zero or one</a></li>
<li><a href="#org3383cee">3.2. A condition variable is a way for a thread to block</a></li>
</ul>
</li>
<li><a href="#orgc14bcd0">4. I/O</a>
<ul>
<li><a href="#org505f052">4.1. Read or write to a given file descriptor in Emacs can be</a></li>
<li><a href="#org37c2fa4">4.2. For processes, there are the functions <code>process-thread</code></a></li>
<li><a href="#orgf80fa1d">4.3. For all other file descriptors, there exists an</a></li>
<li><a href="#org2f3172d">4.4. A further problem is how to make it obvious to a user</a></li>
</ul>
</li>
<li><a href="#orgb9dc162">5. Tramp Adaptions for Being thread-safe</a>
<ul>
<li><a href="#orgfee8762">5.1. Tramp is just a library of basic file operations,</a></li>
<li><a href="#orgd8fc9a2">5.2. Tramp creates a mutex for every connection to a remote</a></li>
<li><a href="#org24a3b17">5.3. Whenever a Tramp function is invoked, the connection</a></li>
<li><a href="#org7a30401">5.4. Superfluous <code>save-excursion</code> calls have been removed.</a></li>
<li><a href="#org5ad7deb">5.5. Minor changes like compatibility functions and thread</a></li>
</ul>
</li>
<li><a href="#org998e6cc">6. Asynchronous File Operations</a>
<ul>
<li><a href="#org80de116">6.1. Shall be triggered by the user.  In order to do this,</a></li>
<li><a href="#org986423c">6.2. In the future, this prefix command is not restricted to</a></li>
<li><a href="#org0ff6df9">6.3. Implemented so far for the file visiting family of commands:</a></li>
<li><a href="#org5d6821f">6.4. Visiting local files would profit only for veeeery large</a></li>
<li><a href="#orgfe6f854">6.5. An alternative approach to use asynchronous file operations</a></li>
</ul>
</li>
<li><a href="#orgd9957cf">7. Outlook</a>
<ul>
<li><a href="#org005539c">7.1. Solve the I/O problem.  First for input (keyboard), but</a></li>
<li><a href="#org7b57df0">7.2. Improve performance.  Apply more fine-tuned <code>thread-yield</code></a></li>
<li><a href="#orgf2372b1">7.3. Implement thread support for further file operations,</a></li>
<li><a href="#org72a9585">7.4. Make file operations for local files thread-aware.</a></li>
<li><a href="#orgf6f655a">7.5. Make <code>vc-refresh-state</code> thread-aware (call <code>thried-yield</code>).</a></li>
<li><a href="#org4ae1f24">7.6. Add indication for running asynchronous file operations</a></li>
<li><a href="#orgdaa65c1">7.7. Add thread support to other packages, like <code>dired</code>.</a></li>
</ul>
</li>
<li><a href="#org0147ba1">8. The End</a>
<ul>
<li><a href="#orgdc6262d">8.1. Local Variables:</a></li>
<li><a href="#org7693bd6">8.2. org-confirm-babel-evaluate: nil</a></li>
<li><a href="#orga3ccbe3">8.3. org-return-follows-link: t</a></li>
<li><a href="#orgbe757d8">8.4. org-hide-macro-markers: t</a></li>
<li><a href="#org2cc2c32">8.5. eval: (setq large-file-warning-threshold 100000000)</a></li>
<li><a href="#orga512fda">8.6. eval: (switch-to-buffer-other-frame (list-threads))</a></li>
<li><a href="#org14c4ef9">8.7. eval: (find-file "/nextcloud:albinus@ford#8081:20180825<sub>091134.jpg</sub>")</a></li>
<li><a href="#orgd07a82b">8.8. End:</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgdeeb637" class="outline-2">
<h2 id="orgdeeb637"><span class="section-number-2">1</span> Emacs Lisp and Threads</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orge8e926d" class="outline-3">
<h3 id="orge8e926d"><span class="section-number-3">1.1</span> Treads have been added in Emacs 26.1. No major package</h3>
<div class="outline-text-3" id="text-1-1">
<p>
has used it there, 'tho.
</p>
</div>
</div>


<div id="outline-container-org726417d" class="outline-3">
<h3 id="org726417d"><span class="section-number-3">1.2</span> During the current development of Emacs 27, Tramp has</h3>
<div class="outline-text-3" id="text-1-2">
<p>
started as first major package to apply threads. While
implementing this, thread support in Emacs has been
extended as needs arise. The following examples are based
on the Emacs git branch <code>feature/tramp-thread-safe</code>; some
examples will work only there.
</p>
</div>
</div>


<div id="outline-container-org01ec4b2" class="outline-3">
<h3 id="org01ec4b2"><span class="section-number-3">1.3</span> Other packages (Gnus, for example) plan also to use threads.</h3>
</div>
</div>


<div id="outline-container-orgcec892d" class="outline-2">
<h2 id="orgcec892d"><span class="section-number-2">2</span> Basic Thread Functions in Emacs Lisp</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org829ce5a" class="outline-3">
<h3 id="org829ce5a"><span class="section-number-3">2.1</span> A thread is the concurrent invocation of a Lisp function.</h3>
<div class="outline-text-3" id="text-2-1">
<p>
It runs until the execution of the function is finished,
or it is interrupted by a signal.  This is <b>mostly
cooperative</b>, meaning that Emacs will only switch
execution between threads at well-defined times.
</p>

<div class="org-src-container">
<pre class="src src-elisp" id="org20ba416">(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">my-thread</span> ()
  (sleep-for 10))

(make-thread #'my-thread <span style="color: #8b2252;">"my thread"</span>)
</pre>
</div>

<p>
There is no real concurrency that two threads run in
parallel on different CPUs.  There is always only one
active thread at any given time.  Emacs threads are not
intended for number crunching.
</p>
</div>
</div>


<div id="outline-container-org2d0df8d" class="outline-3">
<h3 id="org2d0df8d"><span class="section-number-3">2.2</span> If Emacs is compiled with thread support, there are some</h3>
<div class="outline-text-3" id="text-2-2">
<p>
helper functions:
</p>

<div class="org-src-container">
<pre class="src src-elisp" id="orga0408e9">main-thread
(current-thread)
(all-threads)
</pre>
</div>
</div>
</div>


<div id="outline-container-orgcda4933" class="outline-3">
<h3 id="orgcda4933"><span class="section-number-3">2.3</span> Thread switching will occur upon explicit request via</h3>
<div class="outline-text-3" id="text-2-3">
<p>
<code>thread-yield</code>, when waiting for keyboard input or for
process output (e.g., during <code>accept-process-output</code>), or
during blocking operations relating to threads, such as
mutex locking or <code>thread-join</code>.
</p>

<div class="org-src-container">
<pre class="src src-elisp" id="org72f9ba8">(<span style="color: #a020f0;">defvar</span> <span style="color: #a0522d;">wait</span> t)
(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">my-thread</span> ()
  (<span style="color: #a020f0;">while</span> wait (thread-yield))
  (<span style="color: #a020f0;">setq</span> wait t))

(<span style="color: #a020f0;">setq</span> wait t)
(make-thread #'my-thread <span style="color: #8b2252;">"my thread 1"</span>)
(make-thread #'my-thread <span style="color: #8b2252;">"my thread 2"</span>)

<span style="color: #b22222;">;; </span><span style="color: #b22222;">(setq wait nil)</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-orgfbd7bec" class="outline-3">
<h3 id="orgfbd7bec"><span class="section-number-3">2.4</span> The result of a thread evaluation is captured by</h3>
<div class="outline-text-3" id="text-2-4">
<p>
<code>thread-join</code>.  It blocks the current thread until the requested
thread exits, or the current thread is signaled.  This result could
be even retrieved by a <code>thread-join</code> call after that thread has
finished, as many time as requested.
</p>

<div class="org-src-container">
<pre class="src src-elisp" id="orgf6440d5">(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">my-thread1</span> ()
  (sleep-for 10)
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">The result.</span>
  42)

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">my-thread2</span> ()
  (message <span style="color: #8b2252;">"Thread %s has returned %s"</span> thread1 (thread-join thread1)))

(<span style="color: #a020f0;">setq</span> thread1 (make-thread #'my-thread1 <span style="color: #8b2252;">"my thread 1"</span>))
(<span style="color: #a020f0;">setq</span> thread2 (make-thread #'my-thread2 <span style="color: #8b2252;">"my thread 2"</span>))

<span style="color: #b22222;">;; </span><span style="color: #b22222;">(thread-join thread1)</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-org421ac96" class="outline-3">
<h3 id="org421ac96"><span class="section-number-3">2.5</span> A thread could be signaled from another thread by <code>thread-signal</code>.</h3>
<div class="outline-text-3" id="text-2-5">
<div class="org-src-container">
<pre class="src src-elisp" id="orgec9e100">(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">my-thread1</span> ()
  (sleep-for 10)
  (thread-signal thread2 'error '(data)))

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">my-thread2</span> ()
  (<span style="color: #a020f0;">condition-case</span> err
      (<span style="color: #a020f0;">while</span> t (sleep-for 0.1))
    (<span style="color: #ff0000; font-weight: bold;">error</span> (message <span style="color: #8b2252;">"Thread %s signaled by `</span><span style="color: #008b8b;">%s</span><span style="color: #8b2252;">'"</span> (current-thread) err))))

(<span style="color: #a020f0;">setq</span> thread1 (make-thread #'my-thread1 <span style="color: #8b2252;">"my thread 1"</span>))
(<span style="color: #a020f0;">setq</span> thread2 (make-thread #'my-thread2 <span style="color: #8b2252;">"my thread 2"</span>))
</pre>
</div>

<p>
Restriction: signaling the main thread does not work this
way.  The main thread just prints the error message.
</p>

<div class="org-src-container">
<pre class="src src-elisp" id="org88bb5bc">(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">my-thread</span> ()
  (thread-signal main-thread 'error '(data)))

(<span style="color: #a020f0;">setq</span> thread (make-thread #'my-thread <span style="color: #8b2252;">"my thread"</span>))
</pre>
</div>
</div>
</div>
