thread-safe-tramp-2018-09.org
** There are further convenience variables and functions like

   #+NAME: Thread_convenience
   #+BEGIN_SRC elisp
   (thread-name (make-thread #'ignore "my thread"))
   (thread-live-p (make-thread #'ignore "my thread"))
   #+END_SRC

   Read the Elisp manual at [[info:elisp#Basic Thread Functions]]


* Thread Synchronization

** A mutex is an exclusive lock.  At any moment, zero or one
   threads may own a mutex.  If a thread attempts to acquire
   a mutex, and the mutex is already owned by some other
   thread, then the acquiring thread will block until the
   mutex becomes available.  If the mutex is owned by the
   acquiring thread already, a counter is increased.

   When done, a thread owning a mutex shall release it as
   soon as possible.  It is an error not to release a mutex.

   While there are basic functions like ~mutex-lock~ and
   ~mutex-unlock~, it is recommended to use the macro ~with-mutex~.

   #+NAME: Mutex
   #+BEGIN_SRC elisp
   (defvar mutex (make-mutex "my mutex"))

   (defun my-thread ()
     (with-mutex mutex
       (sleep-for 10)))

   (make-thread #'my-thread "my thread 1")
   (make-thread #'my-thread "my thread 2")
   #+END_SRC

   Read the Elisp manual at [[info:elisp#Mutexes]]


** A condition variable is a way for a thread to block
   until some event occurs.  A thread can wait on a
   condition variable, to be woken up when some other thread
   notifies the condition.

   A condition variable is associated with a mutex.  For
   proper operation, the mutex must be acquired, and then a
   waiting thread must wait on the condition variable.

   #+NAME: Cond_var
   #+BEGIN_SRC elisp
   (defvar mutex (make-mutex "my mutex"))
   (defvar cond-var (make-condition-variable mutex "my condition variable"))

   (defun my-thread1 ()
     (with-mutex mutex
       (condition-wait cond-var))
     (sleep-for 10))

   (defun my-thread2 ()
     (sleep-for 10)
     (with-mutex mutex
       (condition-notify cond-var))
     (sleep-for 5))

   (make-thread #'my-thread1 "my thread 1")
   (make-thread #'my-thread2 "my thread 2")
   #+END_SRC

   Read the Elisp manual at [[info:elisp#Condition Variables]]


* I/O

** Read or write to a given file descriptor in Emacs can be
   done to only one thread at any time.


** For processes, there are the functions ~process-thread~
   and ~set-process-thread~, which assign process related
   file descriptors to a given thread.  If another thread
   shall take over control, this must be requested
   explicitly.


** For all other file descriptors, there exists an
   implementation to assign them to a given thread
   on-the-fly. This does not work well (see bug#25214 and
   bug#32426), as a consequence keyboard input shall be
   restricted to the main thread as-of-today.

   We're working on this.


** A further problem is how to make it obvious to a user
   where keyboard input goes to.  Imagine the possible
   scenario to copy a file, and to remove another file in
   parallel.  Both operations require user confirmation
   ("Overwrite file a/b?" "Remove file c/d?"), and it must
   be obvious for which question the answer "y" is intended
   for.  See discussion in the emacs-devel@gnu.org mailing
   list [[http://lists.gnu.org/archive/html/emacs-devel/2018-08/msg00456.html]]


* Tramp Adaptions for Being thread-safe

** Tramp is just a library of basic file operations,
   replacing default file operations for files located on
   remote hosts.

   It does not create any thread on its own.  Whether
   concurrent operations do run, is decided by the user.

   Changes to make Tramp thread-safe were surprisingly simple.


** Tramp creates a mutex for every connection to a remote
   host.  That means, operations for a given connection are
   run sequentially (see [[file:~/src/tramp/lisp/tramp.el::2275][~tramp-file-name-handler~]]).


** Whenever a Tramp function is invoked, the connection
   process is locked to the current thread.  This gives a
   kind of dynamics in locking the process, but it is safe
   due to the mutex.


** Superfluous ~save-excursion~ calls have been removed.
   They made concurrent editing impossible (flipping cursor).


** Minor changes like compatibility functions and thread
   information in the debug buffer.


* Asynchronous File Operations

** Shall be triggered by the user.  In order to do this,
   there is a new prefix command ~universal-async-argument~
   ({{{C-x & ...}}}), like the prefix argument ~universal-argument~
   ({{{C-u ...}}}) for interactive commands.  This is *not* only
   for remote files (Tramp).


** In the future, this prefix command is not restricted to
   asynchronous file operations.  Any interactive command,
   which could run also asynchronously, shall use this as
   user indication.

   It is up to the command to decide, what asynchronous
   means.  For example, ~gnus~ would rather retrieve
   articles from the respective servers, and not care about
   file operations.


