thread-safe-tramp-2018-09.html


<div id="outline-container-orgd15fded" class="outline-3">
<h3 id="orgd15fded"><span class="section-number-3">2.6</span> There are further convenience variables and functions like</h3>
<div class="outline-text-3" id="text-2-6">
<div class="org-src-container">
<pre class="src src-elisp" id="org03cca29">(thread-name (make-thread #'ignore <span style="color: #8b2252;">"my thread"</span>))
(thread-live-p (make-thread #'ignore <span style="color: #8b2252;">"my thread"</span>))
</pre>
</div>

<p>
Read the Elisp manual at <a href="https://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Basic-Thread-Functions">elisp#Basic Thread Functions</a>
</p>
</div>
</div>
</div>


<div id="outline-container-org473ce04" class="outline-2">
<h2 id="org473ce04"><span class="section-number-2">3</span> Thread Synchronization</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org3a4873e" class="outline-3">
<h3 id="org3a4873e"><span class="section-number-3">3.1</span> A mutex is an exclusive lock.  At any moment, zero or one</h3>
<div class="outline-text-3" id="text-3-1">
<p>
threads may own a mutex.  If a thread attempts to acquire
a mutex, and the mutex is already owned by some other
thread, then the acquiring thread will block until the
mutex becomes available.  If the mutex is owned by the
acquiring thread already, a counter is increased.
</p>

<p>
When done, a thread owning a mutex shall release it as
soon as possible.  It is an error not to release a mutex.
</p>

<p>
While there are basic functions like <code>mutex-lock</code> and
<code>mutex-unlock</code>, it is recommended to use the macro <code>with-mutex</code>.
</p>

<div class="org-src-container">
<pre class="src src-elisp" id="orgc8a5615">(<span style="color: #a020f0;">defvar</span> <span style="color: #a0522d;">mutex</span> (make-mutex <span style="color: #8b2252;">"my mutex"</span>))

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">my-thread</span> ()
  (<span style="color: #a020f0;">with-mutex</span> mutex
    (sleep-for 10)))

(make-thread #'my-thread <span style="color: #8b2252;">"my thread 1"</span>)
(make-thread #'my-thread <span style="color: #8b2252;">"my thread 2"</span>)
</pre>
</div>

<p>
Read the Elisp manual at <a href="https://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Mutexes">elisp#Mutexes</a>
</p>
</div>
</div>


<div id="outline-container-org3383cee" class="outline-3">
<h3 id="org3383cee"><span class="section-number-3">3.2</span> A condition variable is a way for a thread to block</h3>
<div class="outline-text-3" id="text-3-2">
<p>
until some event occurs.  A thread can wait on a
condition variable, to be woken up when some other thread
notifies the condition.
</p>

<p>
A condition variable is associated with a mutex.  For
proper operation, the mutex must be acquired, and then a
waiting thread must wait on the condition variable.
</p>

<div class="org-src-container">
<pre class="src src-elisp" id="orgd5c0e34">(<span style="color: #a020f0;">defvar</span> <span style="color: #a0522d;">mutex</span> (make-mutex <span style="color: #8b2252;">"my mutex"</span>))
(<span style="color: #a020f0;">defvar</span> <span style="color: #a0522d;">cond-var</span> (make-condition-variable mutex <span style="color: #8b2252;">"my condition variable"</span>))

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">my-thread1</span> ()
  (<span style="color: #a020f0;">with-mutex</span> mutex
    (condition-wait cond-var))
  (sleep-for 10))

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">my-thread2</span> ()
  (sleep-for 10)
  (<span style="color: #a020f0;">with-mutex</span> mutex
    (condition-notify cond-var))
  (sleep-for 5))

(make-thread #'my-thread1 <span style="color: #8b2252;">"my thread 1"</span>)
(make-thread #'my-thread2 <span style="color: #8b2252;">"my thread 2"</span>)
</pre>
</div>

<p>
Read the Elisp manual at <a href="https://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Condition-Variables">elisp#Condition Variables</a>
</p>
</div>
</div>
</div>


<div id="outline-container-orgc14bcd0" class="outline-2">
<h2 id="orgc14bcd0"><span class="section-number-2">4</span> I/O</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org505f052" class="outline-3">
<h3 id="org505f052"><span class="section-number-3">4.1</span> Read or write to a given file descriptor in Emacs can be</h3>
<div class="outline-text-3" id="text-4-1">
<p>
done to only one thread at any time.
</p>
</div>
</div>


<div id="outline-container-org37c2fa4" class="outline-3">
<h3 id="org37c2fa4"><span class="section-number-3">4.2</span> For processes, there are the functions <code>process-thread</code></h3>
<div class="outline-text-3" id="text-4-2">
<p>
and <code>set-process-thread</code>, which assign process related
file descriptors to a given thread.  If another thread
shall take over control, this must be requested
explicitly.
</p>
</div>
</div>


<div id="outline-container-orgf80fa1d" class="outline-3">
<h3 id="orgf80fa1d"><span class="section-number-3">4.3</span> For all other file descriptors, there exists an</h3>
<div class="outline-text-3" id="text-4-3">
<p>
implementation to assign them to a given thread
on-the-fly. This does not work well (see bug#25214 and
bug#32426), as a consequence keyboard input shall be
restricted to the main thread as-of-today.
</p>

<p>
We're working on this.
</p>
</div>
</div>


<div id="outline-container-org2f3172d" class="outline-3">
<h3 id="org2f3172d"><span class="section-number-3">4.4</span> A further problem is how to make it obvious to a user</h3>
<div class="outline-text-3" id="text-4-4">
<p>
where keyboard input goes to.  Imagine the possible
scenario to copy a file, and to remove another file in
parallel.  Both operations require user confirmation
("Overwrite file a/b?" "Remove file c/d?"), and it must
be obvious for which question the answer "y" is intended
for.  See discussion in the emacs-devel@gnu.org mailing
list <a href="http://lists.gnu.org/archive/html/emacs-devel/2018-08/msg00456.html">http://lists.gnu.org/archive/html/emacs-devel/2018-08/msg00456.html</a>
</p>
</div>
</div>
</div>


<div id="outline-container-orgb9dc162" class="outline-2">
<h2 id="orgb9dc162"><span class="section-number-2">5</span> Tramp Adaptions for Being thread-safe</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgfee8762" class="outline-3">
<h3 id="orgfee8762"><span class="section-number-3">5.1</span> Tramp is just a library of basic file operations,</h3>
<div class="outline-text-3" id="text-5-1">
<p>
replacing default file operations for files located on
remote hosts.
</p>

<p>
It does not create any thread on its own.  Whether
concurrent operations do run, is decided by the user.
</p>

<p>
Changes to make Tramp thread-safe were surprisingly simple.
</p>
</div>
</div>


<div id="outline-container-orgd8fc9a2" class="outline-3">
<h3 id="orgd8fc9a2"><span class="section-number-3">5.2</span> Tramp creates a mutex for every connection to a remote</h3>
<div class="outline-text-3" id="text-5-2">
<p>
host.  That means, operations for a given connection are
run sequentially (see <a href="file:///home/tils/src/tramp/lisp/tramp.el#MissingReference"><code>tramp-file-name-handler</code></a>).
</p>
</div>
</div>


<div id="outline-container-org24a3b17" class="outline-3">
<h3 id="org24a3b17"><span class="section-number-3">5.3</span> Whenever a Tramp function is invoked, the connection</h3>
<div class="outline-text-3" id="text-5-3">
<p>
process is locked to the current thread.  This gives a
kind of dynamics in locking the process, but it is safe
due to the mutex.
</p>
</div>
</div>


<div id="outline-container-org7a30401" class="outline-3">
<h3 id="org7a30401"><span class="section-number-3">5.4</span> Superfluous <code>save-excursion</code> calls have been removed.</h3>
<div class="outline-text-3" id="text-5-4">
<p>
They made concurrent editing impossible (flipping cursor).
</p>
</div>
</div>


<div id="outline-container-org5ad7deb" class="outline-3">
<h3 id="org5ad7deb"><span class="section-number-3">5.5</span> Minor changes like compatibility functions and thread</h3>
<div class="outline-text-3" id="text-5-5">
<p>
information in the debug buffer.
</p>
</div>
</div>
</div>


<div id="outline-container-org998e6cc" class="outline-2">
<h2 id="org998e6cc"><span class="section-number-2">6</span> Asynchronous File Operations</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org80de116" class="outline-3">
<h3 id="org80de116"><span class="section-number-3">6.1</span> Shall be triggered by the user.  In order to do this,</h3>
<div class="outline-text-3" id="text-6-1">
<p>
there is a new prefix command <code>universal-async-argument</code>
({{{C-x &amp; &#x2026;}}}), like the prefix argument <code>universal-argument</code>
({{{C-u &#x2026;}}}) for interactive commands.  This is <b>not</b> only
for remote files (Tramp).
</p>
</div>
</div>


<div id="outline-container-org986423c" class="outline-3">
<h3 id="org986423c"><span class="section-number-3">6.2</span> In the future, this prefix command is not restricted to</h3>
<div class="outline-text-3" id="text-6-2">
<p>
asynchronous file operations.  Any interactive command,
which could run also asynchronously, shall use this as
user indication.
</p>

<p>
It is up to the command to decide, what asynchronous
means.  For example, <code>gnus</code> would rather retrieve
articles from the respective servers, and not care about
file operations.
</p>
</div>
</div>
