thread-safe-tramp-2018-09.org
** Implemented so far for the file visiting family of commands:

   ~find-file~ 	      	      	       {{{C-x & C-x C-f}}}
   ~find-file-other-window~            {{{C-x & C-x 4 f}}}
   ~find-file-other-frame~     	       {{{C-x & C-x 5 f}}}
   ~find-file-existing~ 	       {{{C-x & M-x find-file-existing}}}
   ~find-file-read-only~ 	       {{{C-x & C-x C-r}}}
   ~find-file-read-only-other-window~  {{{C-x & C-x 4 r}}}
   ~find-file-read-only-other-frame~   {{{C-x & C-x 5 f}}}
   ~find-alternate-file~ 	       {{{C-x & C-x C-v}}}
   ~find-alternate-file-other-window~  {{{C-x & M-x find-alternate-file-other-window}}}
   ~find-file-literally~ 	       {{{C-x & M-x find-file-literally}}}


** Visiting local files would profit only for veeeery large
   files (some hundred of MB).  Natural candidates are remote
   files to be visited, and local files to be visited with wildcard.

   However, visiting local files has not been adapted yet to
   throw sufficient ~thread-yield~ calls.  The main thread
   keeps blocked.  Therefore, remote file operations remain
   best candidates as of today.

   #+NAME: Visit_remote_file
   #+BEGIN_SRC elisp
   ;; (find-file "/sftp::/var/log/ConsoleKit/history.1" nil t)
   ;; (find-file "/gdrive:michael.rd.albinus@gmail.com:20180825_091134.jpg" nil t)
   (find-file "/nextcloud:albinus@ford#8081:20180825_091134.jpg" nil t)
   #+END_SRC

   #+NAME: Visit_remote_files_wildcard
   #+BEGIN_SRC elisp
   (find-file "/sftp::~/src/emacs/lisp/net/tramp*.el" t t)
   #+END_SRC

   #+NAME: Kill_threads_and_buffers
   #+BEGIN_SRC elisp
   (dolist (thread (all-threads))
     (unless (eq thread main-thread)
       (thread-signal thread 'quit nil)))
   (dolist (buffer (buffer-list))
     (when (string-match "^tramp" (buffer-name buffer))
       (kill-buffer buffer)))
   #+END_SRC

   ~vc-refresh-state~ recomputes the VC state of a file.  In
   the Tramp case, it often takes more time to compute it
   for git, than just loading the file into a buffer.
   Therefore, this function gets also an own thread.  It
   needs to be tuned to throw proper ~thread-yield~ calls.


** An alternative approach to use asynchronous file operations
   is user option ~execute-file-commands-asynchronously~.
   If this variable is non-nil, a file will be visited
   asynchronously when called interactively.  If it is a
   regular expression, it must match the file name to be
   visited.

   It toggles the behavior of ({{{C-x & ...}}}).

   #+NAME: Visit_remote_files_wildcard_execute_file_commands_asynchronously
   #+BEGIN_SRC elisp
   (setq execute-file-commands-asynchronously tramp-file-name-regexp)
   (find-file
     "/sftp::~/src/emacs/lisp/net/tramp*.el"
     t execute-file-commands-asynchronously)
   #+END_SRC


* Outlook

** Solve the I/O problem.  First for input (keyboard), but
   also for arriving events (D-Bus, file notifications, ...)


** Improve performance.  Apply more fine-tuned ~thread-yield~
   calls.  Add thread priority, especially with high
   priority for the main thread.


** Implement thread support for further file operations,
   like ~save-buffer~, ~copy-file~, ~rename-file~, ...


** Make file operations for local files thread-aware.


** Make ~vc-refresh-state~ thread-aware (call ~thried-yield~).


** Add indication for running asynchronous file operations
   in the background (modeline?).


** Add thread support to other packages, like ~dired~.


* The End

** Local Variables:
** org-confirm-babel-evaluate: nil
** org-return-follows-link: t
** org-hide-macro-markers: t
** eval: (setq large-file-warning-threshold 100000000)
** eval: (switch-to-buffer-other-frame (list-threads))
** eval: (find-file "/nextcloud:albinus@ford#8081:20180825_091134.jpg")
** End:
