thread-safe-tramp-2018-09.html


<div id="outline-container-org0ff6df9" class="outline-3">
<h3 id="org0ff6df9"><span class="section-number-3">6.3</span> Implemented so far for the file visiting family of commands:</h3>
<div class="outline-text-3" id="text-6-3">
<p>
<code>find-file</code>                       {{{C-x &amp; C-x C-f}}}
<code>find-file-other-window</code>            {{{C-x &amp; C-x 4 f}}}
<code>find-file-other-frame</code>             {{{C-x &amp; C-x 5 f}}}
<code>find-file-existing</code>         {{{C-x &amp; M-x find-file-existing}}}
<code>find-file-read-only</code>         {{{C-x &amp; C-x C-r}}}
<code>find-file-read-only-other-window</code>  {{{C-x &amp; C-x 4 r}}}
<code>find-file-read-only-other-frame</code>   {{{C-x &amp; C-x 5 f}}}
<code>find-alternate-file</code>         {{{C-x &amp; C-x C-v}}}
<code>find-alternate-file-other-window</code>  {{{C-x &amp; M-x find-alternate-file-other-window}}}
<code>find-file-literally</code>         {{{C-x &amp; M-x find-file-literally}}}
</p>
</div>
</div>


<div id="outline-container-org5d6821f" class="outline-3">
<h3 id="org5d6821f"><span class="section-number-3">6.4</span> Visiting local files would profit only for veeeery large</h3>
<div class="outline-text-3" id="text-6-4">
<p>
files (some hundred of MB).  Natural candidates are remote
files to be visited, and local files to be visited with wildcard.
</p>

<p>
However, visiting local files has not been adapted yet to
throw sufficient <code>thread-yield</code> calls.  The main thread
keeps blocked.  Therefore, remote file operations remain
best candidates as of today.
</p>

<div class="org-src-container">
<pre class="src src-elisp" id="org8966918"><span style="color: #b22222;">;; </span><span style="color: #b22222;">(find-file "/sftp::/var/log/ConsoleKit/history.1" nil t)</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">(find-file "/gdrive:michael.rd.albinus@gmail.com:20180825_091134.jpg" nil t)</span>
(find-file <span style="color: #8b2252;">"/nextcloud:albinus@ford#8081:20180825_091134.jpg"</span> nil t)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-elisp" id="org3de4511">(find-file <span style="color: #8b2252;">"/sftp::~/src/emacs/lisp/net/tramp*.el"</span> t t)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-elisp" id="org299f21b">(<span style="color: #a020f0;">dolist</span> (thread (all-threads))
  (<span style="color: #a020f0;">unless</span> (eq thread main-thread)
    (thread-signal thread 'quit nil)))
(<span style="color: #a020f0;">dolist</span> (buffer (buffer-list))
  (<span style="color: #a020f0;">when</span> (string-match <span style="color: #8b2252;">"^tramp"</span> (buffer-name buffer))
    (kill-buffer buffer)))
</pre>
</div>

<p>
<code>vc-refresh-state</code> recomputes the VC state of a file.  In
the Tramp case, it often takes more time to compute it
for git, than just loading the file into a buffer.
Therefore, this function gets also an own thread.  It
needs to be tuned to throw proper <code>thread-yield</code> calls.
</p>
</div>
</div>


<div id="outline-container-orgfe6f854" class="outline-3">
<h3 id="orgfe6f854"><span class="section-number-3">6.5</span> An alternative approach to use asynchronous file operations</h3>
<div class="outline-text-3" id="text-6-5">
<p>
is user option <code>execute-file-commands-asynchronously</code>.
If this variable is non-nil, a file will be visited
asynchronously when called interactively.  If it is a
regular expression, it must match the file name to be
visited.
</p>

<p>
It toggles the behavior of ({{{C-x &amp; &#x2026;}}}).
</p>

<div class="org-src-container">
<pre class="src src-elisp" id="org541018f">(<span style="color: #a020f0;">setq</span> execute-file-commands-asynchronously tramp-file-name-regexp)
(find-file
  <span style="color: #8b2252;">"/sftp::~/src/emacs/lisp/net/tramp*.el"</span>
  t execute-file-commands-asynchronously)
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orgd9957cf" class="outline-2">
<h2 id="orgd9957cf"><span class="section-number-2">7</span> Outlook</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org005539c" class="outline-3">
<h3 id="org005539c"><span class="section-number-3">7.1</span> Solve the I/O problem.  First for input (keyboard), but</h3>
<div class="outline-text-3" id="text-7-1">
<p>
also for arriving events (D-Bus, file notifications, &#x2026;)
</p>
</div>
</div>


<div id="outline-container-org7b57df0" class="outline-3">
<h3 id="org7b57df0"><span class="section-number-3">7.2</span> Improve performance.  Apply more fine-tuned <code>thread-yield</code></h3>
<div class="outline-text-3" id="text-7-2">
<p>
calls.  Add thread priority, especially with high
priority for the main thread.
</p>
</div>
</div>


<div id="outline-container-orgf2372b1" class="outline-3">
<h3 id="orgf2372b1"><span class="section-number-3">7.3</span> Implement thread support for further file operations,</h3>
<div class="outline-text-3" id="text-7-3">
<p>
like <code>save-buffer</code>, <code>copy-file</code>, <code>rename-file</code>, &#x2026;
</p>
</div>
</div>


<div id="outline-container-org72a9585" class="outline-3">
<h3 id="org72a9585"><span class="section-number-3">7.4</span> Make file operations for local files thread-aware.</h3>
</div>


<div id="outline-container-orgf6f655a" class="outline-3">
<h3 id="orgf6f655a"><span class="section-number-3">7.5</span> Make <code>vc-refresh-state</code> thread-aware (call <code>thried-yield</code>).</h3>
</div>


<div id="outline-container-org4ae1f24" class="outline-3">
<h3 id="org4ae1f24"><span class="section-number-3">7.6</span> Add indication for running asynchronous file operations</h3>
<div class="outline-text-3" id="text-7-6">
<p>
in the background (modeline?).
</p>
</div>
</div>


<div id="outline-container-orgdaa65c1" class="outline-3">
<h3 id="orgdaa65c1"><span class="section-number-3">7.7</span> Add thread support to other packages, like <code>dired</code>.</h3>
</div>
</div>


<div id="outline-container-org0147ba1" class="outline-2">
<h2 id="org0147ba1"><span class="section-number-2">8</span> The End</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-orgdc6262d" class="outline-3">
<h3 id="orgdc6262d"><span class="section-number-3">8.1</span> Local Variables:</h3>
</div>
<div id="outline-container-org7693bd6" class="outline-3">
<h3 id="org7693bd6"><span class="section-number-3">8.2</span> org-confirm-babel-evaluate: nil</h3>
</div>
<div id="outline-container-orga3ccbe3" class="outline-3">
<h3 id="orga3ccbe3"><span class="section-number-3">8.3</span> org-return-follows-link: t</h3>
</div>
<div id="outline-container-orgbe757d8" class="outline-3">
<h3 id="orgbe757d8"><span class="section-number-3">8.4</span> org-hide-macro-markers: t</h3>
</div>
<div id="outline-container-org2cc2c32" class="outline-3">
<h3 id="org2cc2c32"><span class="section-number-3">8.5</span> eval: (setq large-file-warning-threshold 100000000)</h3>
</div>
<div id="outline-container-orga512fda" class="outline-3">
<h3 id="orga512fda"><span class="section-number-3">8.6</span> eval: (switch-to-buffer-other-frame (list-threads))</h3>
</div>
<div id="outline-container-org14c4ef9" class="outline-3">
<h3 id="org14c4ef9"><span class="section-number-3">8.7</span> eval: (find-file "/nextcloud:albinus@ford#8081:20180825<sub>091134.jpg</sub>")</h3>
</div>
<div id="outline-container-orgd07a82b" class="outline-3">
<h3 id="orgd07a82b"><span class="section-number-3">8.8</span> End:</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-09-26 Wed 00:00</p>
<p class="author">Author: Michael Albinus</p>
<p class="date">Created: 2018-09-27 Thu 21:08</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
